In [5]:
import pandas as pd

# Operations
There are lots of operations with padnas that will be really useful tot you, but you don't fall into any disticnt categroy. Let's show

In [9]:
df = pd.DataFrame({
    'col1': [1,2,3,4],
    'col2': [444, 555, 666, 777],
    'col3': ['abc', 'def', 'ghi', 'xyz']
})

In [10]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   777  xyz

### Info On Unique Values

In [12]:
df['col2'].unique()

array([444, 555, 666, 777], dtype=int64)

In [15]:
df['col2'].nuique() #number of unique elements

AttributeError: 'Series' object has no attribute 'nuique'

In [16]:
df['col2'].value_counts()

444    1
555    1
666    1
777    1
Name: col2, dtype: int64

In [18]:
new_df = df[(df['col2'] > 600) & (df['col2'] < 700)]

In [19]:
new_df

   col1  col2 col3
2     3   666  ghi

In [20]:
def times2(x):
    return x *2

In [23]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [27]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [29]:
df.apply(len) # lengths of each dataframe row

col1    4
col2    4
col3    4
dtype: int64

In [30]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   777  xyz

In [26]:
df['col1'].sum() # sum all rows of col1

10

In [31]:
df['col2'].apply(lambda x: x * 2)

0     888
1    1110
2    1332
3    1554
Name: col2, dtype: int64

** Permanently Removing a Column

In [35]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [37]:
df.sort_values(by='col2', ascending=False) #inplace False by default

   col1  col2 col3
3     4   777  xyz
2     3   666  ghi
1     2   555  def
0     1   444  abc

In [39]:
df.isnull() # shows boolean df

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [40]:
df.fillna("FILL")

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   777  xyz

In [ ]:
# pivot table watch it at home